# 6.	Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

let = chr(int(input("Введите номер буквы в алфавите")))
print(let)