#5.	В массиве найти максимальный отрицательный элемент.
# Вывести на экран его значение и позицию (индекс) в массиве.

a = [-3, 77, 8, 43, -5, -22, 82, -23]

max_neg_elem = a[0]
pos = 0
for i in range(len(a)):
    if a[i] < 0:
        if max_neg_elem < a[i]:
            max_neg_elem = a[i]
            pos = i

print(f"Максимальный отрицательный элемент в массиве: {max_neg_elem}")
print(f"Его позиция в массиве: {pos}")